<hr style="border-top: 10px groove goldenrod; margin-top: 1px; margin-bottom: 1px"></hr>

# <font color=goldenrod>Prepare Data for Classification</font>

<hr style="border-top: 10px groove goldenrod; margin-top: 1px; margin-bottom: 1px"></hr>

# Big Ideas

- Reproducibility puts the science in data science!

- 

# Objectives 

**By the end of the acquire lesson and exercises, you will be able to...**

- **:**


- **:**

<hr style="border-top: 10px groove goldenrod; margin-top: 1px; margin-bottom: 1px"></hr>

In [1]:
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

from sklearn.model_selection import train_test_split
from sklearn.impute import SimpleImputer
from sklearn.preprocessing import LabelEncoder, OneHotEncoder, MinMaxScaler

# ignore warnings
import warnings
warnings.filterwarnings("ignore")

from darden_class_acquire import get_titanic_data, get_iris_data

<hr style="border-top: 10px groove goldenrod; margin-top: 1px; margin-bottom: 1px"></hr>

## Iris Data

___

### Use the function defined in acquire.py to load the iris data.

In [ ]:
iris = get_iris_data()
iris.head()

___

### Drop the species_id and measurement_id columns.

In [ ]:
iris = iris.drop(columns='species_id')
iris.head(2)

___

### Rename the species_name column to just species.

In [ ]:
iris = iris.rename(columns={'species_name': 'species'})
iris.head(2)

___

### Create dummy variables of the species name.

In [ ]:
species_dummies = pd.get_dummies(iris.species, drop_first=True)
species_dummies.head(3)

In [ ]:
iris = pd.concat([iris, species_dummies], axis=1)
iris.head()

___

### Create a function named prep_iris that accepts the untransformed iris data, and returns the data with the transformations above applied.

In [2]:
def prep_iris(cached=True):
    '''
    This function acquires and prepares the iris data from a local csv, default.
    Passing cached=False acquires fresh data from Codeup db and writes to csv.
    Returns the iris df with dummy variables encoding species.
    '''
    df = get_iris_data(cached)
    df = df.drop(columns='species_id').rename(columns={'species_name': 'species'})
    species_dummies = pd.get_dummies(df.species, drop_first=True)
    df = pd.concat([df, species_dummies], axis=1)
    return df

In [3]:
prep_iris()

,species,sepal_length,sepal_width,petal_length,petal_width,versicolor,virginica
0,setosa,5.1,3.5,1.4,0.2,0,0
1,setosa,4.9,3.0,1.4,0.2,0,0
2,setosa,4.7,3.2,1.3,0.2,0,0
3,setosa,4.6,3.1,1.5,0.2,0,0
4,setosa,5.0,3.6,1.4,0.2,0,0
...,...,...,...,...,...,...,...
145,virginica,6.7,3.0,5.2,2.3,0,1
146,virginica,6.3,2.5,5.0,1.9,0,1
147,virginica,6.5,3.0,5.2,2.0,0,1
148,virginica,6.2,3.4,5.4,2.3,0,1
149,virginica,5.9,3.0,5.1,1.8,0,1

<hr style="border-top: 10px groove goldenrod; margin-top: 1px; margin-bottom: 1px"></hr>

## Titanic Data

___

### Use the function you defined in acquire.py to load the titanic data set.

In [4]:
titanic = get_titanic_data()
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

___

### Handle the missing values in the embark_town and embarked columns.

- With a quick check, I see that in total I would only be dropping two rows, so that's how I'm going to handle these missing values.

In [7]:
titanic[titanic.embark_town.isnull()]

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
61,61,1,1,female,38.0,0,0,80.0,NaN,First,B,NaN,1
829,829,1,1,female,62.0,0,0,80.0,NaN,First,B,NaN,1

In [8]:
titanic[titanic.embarked.isnull()]

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
61,61,1,1,female,38.0,0,0,80.0,NaN,First,B,NaN,1
829,829,1,1,female,62.0,0,0,80.0,NaN,First,B,NaN,1

In [12]:
titanic = titanic[~titanic.embarked.isnull()]
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 13 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  889 non-null    int64
 1   survived      889 non-null    int64
 2   pclass        889 non-null    int64
 3   sex           889 non-null    object
 4   age           712 non-null    float64
 5   sibsp         889 non-null    int64
 6   parch         889 non-null    int64
 7   fare          889 non-null    float64
 8   embarked      889 non-null    object
 9   class         889 non-null    object
 10  deck          201 non-null    object
 11  embark_town   889 non-null    object
 12  alone         889 non-null    int64
dtypes: float64(2), int64(6), object(5)
memory usage: 97.2+ KB

___

### Remove the deck column.

In [15]:
titanic = titanic.drop(columns='deck')
titanic.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 889 entries, 0 to 890
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   passenger_id  889 non-null    int64
 1   survived      889 non-null    int64
 2   pclass        889 non-null    int64
 3   sex           889 non-null    object
 4   age           712 non-null    float64
 5   sibsp         889 non-null    int64
 6   parch         889 non-null    int64
 7   fare          889 non-null    float64
 8   embarked      889 non-null    object
 9   class         889 non-null    object
 10  embark_town   889 non-null    object
 11  alone         889 non-null    int64
dtypes: float64(2), int64(6), object(4)
memory usage: 90.3+ KB

___

### Create a dummy variable of the embarked column.

In [24]:
titanic_dummies = pd.get_dummies(titanic.embarked, drop_first=True)
titanic_dummies.sample(10)

     Q  S
575  0  1
767  1  0
590  0  1
879  0  0
200  0  1
666  0  1
871  0  1
774  0  1
370  0  0
678  0  1

In [26]:
titanic = pd.concat([titanic, titanic_dummies], axis=1)
titanic.head()

,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,embark_town,alone,Q,S
0,0,0,3,male,22.0,1,0,7.2500,S,Third,Southampton,0,0,1
1,1,1,1,female,38.0,1,0,71.2833,C,First,Cherbourg,0,0,0
2,2,1,3,female,26.0,0,0,7.9250,S,Third,Southampton,1,0,1
3,3,1,1,female,35.0,1,0,53.1000,S,First,Southampton,0,0,1
4,4,0,3,male,35.0,0,0,8.0500,S,Third,Southampton,1,0,1

___